int getLevelByXp(int xp) {
  const List<int> xpThresholds = [
    0, // уровень 1
    300, // уровень 2
    900, // уровень 3
    2700, // уровень 4
    6500, // уровень 5
    14000, // уровень 6
    23000, // уровень 7
    34000, // уровень 8
    48000, // уровень 9
    64000, // уровень 10
    85000, // уровень 11
    100000, // уровень 12
    120000, // уровень 13
    140000, // уровень 14
    165000, // уровень 15
    195000, // уровень 16
    225000, // уровень 17
    265000, // уровень 18
    305000, // уровень 19
    355000 // уровень 20
  ];

  for (int i = xpThresholds.length - 1; i >= 0; i--) {
    if (xp >= xpThresholds[i]) {
      return i + 1;
    }
  }

  return 1;
}
